#+author: death-of-rats
#+title: RSA-AES challenge
#+date: \today
#+LATEX_HEADER: \usepackage{amsfonts}
#+LATEX_HEADERL \usepackage{unicode-math}

#+BEGIN_SRC jupyter-python :session local :display plain
from Crypto.Cipher import AES
from Crypto.Util.number import long_to_bytes, bytes_to_long
import hashlib
import pwn

p = 0x509efab16c5e2772fa00fc180766b6e62c09bdbd65637793c70b6094f6a7bb8189172685d2bddf87564fe2a6bc596ce28867fd7bbc300fd241b8e3348df6a0b076a0b438824517e0a87c38946fa69511f4201505fca11bc08f257e7a4bb009b4f16b34b3c15ec63c55a9dac306f4daa6f4e8b31ae700eba47766d0d907e2b9633a957f19398151111a879563cbe719ddb4a4078dd4ba42ebbf15203d75a4ed3dcd126cb86937222d2ee8bddc973df44435f3f9335f062b7b68c3da300e88bf1013847af1203402a3147b6f7ddab422d29d56fc7dcb8ad7297b04ccc52f7bc5fdd90bf9e36d01902e0e16aa4c387294c1605c6859b40dad12ae28fdfd3250a2e9
g = 2

sequence = b"Initialization Sequence - Code 0"

key = hashlib.md5(long_to_bytes(0)).digest()
cipher = AES.new(key, AES.MODE_ECB)
encrypted_sequence = cipher.encrypt(sequence)

print(hex(bytes_to_long(encrypted_sequence)))

#+END_SRC

#+RESULTS:
: pi=2
: pi=2
: pi=2
: pi=449
: co zostało: dp=2833368596060627104297621689724582418818088741727328586848364288890617429242038339249115206131535489993746608458743666377260375074756358645474020891310810791516734878440572439975436318072677577943527193830225567365598558170304164278861855578820094184119658846182279962051046127091136238258022119378239701160613140838240879864994661140144885918857511186512211283921113206830164722713905754001534000113279415547956181090124976012758030552091171810970647802896482656888337205792902573646446827623755816691514058445733481021177554146874473572513850340527801692217579915993083571079389958643297007822542242641742348701
